apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_rcc.h
/****************************************************************************
 * arch/arm/src/stm32u3/hardware/stm32u3xx_rcc.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3XX_RCC_H
#define __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3XX_RCC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define STM32_RCC_CR_OFFSET          0x0000
#define STM32_RCC_ICSCR1_OFFSET      0x0008
#define STM32_RCC_ICSCR2_OFFSET      0x000c
#define STM32_RCC_ICSCR3_OFFSET      0x0010
#define STM32_RCC_CRRCR_OFFSET       0x0014
#define STM32_RCC_CFGR1_OFFSET       0x001c
#define STM32_RCC_CFGR2_OFFSET       0x0020
#define STM32_RCC_CFGR3_OFFSET       0x0024
#define STM32_RCC_CFGR4_OFFSET       0x0028
#define STM32_RCC_CIER_OFFSET        0x0050
#define STM32_RCC_CIFR_OFFSET        0x0054
#define STM32_RCC_CICR_OFFSET        0x0058
#define STM32_RCC_AHB1RSTR1_OFFSET   0x0060
#define STM32_RCC_AHB2RSTR1_OFFSET   0x0064
#define STM32_RCC_AHB2RSTR2_OFFSET   0x0068
#define STM32_RCC_APB1RSTR1_OFFSET   0x0074
#define STM32_RCC_APB1RSTR2_OFFSET   0x0078
#define STM32_RCC_APB2RSTR_OFFSET    0x007c
#define STM32_RCC_APB3RSTR_OFFSET    0x0080
#define STM32_RCC_AHB1ENR1_OFFSET    0x0088
#define STM32_RCC_AHB2ENR1_OFFSET    0x008c
#define STM32_RCC_AHB2ENR2_OFFSET    0x0090
#define STM32_RCC_AHB1ENR2_OFFSET    0x0094
#define STM32_RCC_APB1ENR1_OFFSET    0x009c
#define STM32_RCC_APB1ENR2_OFFSET    0x00a0
#define STM32_RCC_APB2ENR_OFFSET     0x00a4
#define STM32_RCC_APB3ENR_OFFSET     0x00a8
#define STM32_RCC_AHB1SLPENR1_OFFSET 0x00b0
#define STM32_RCC_AHB2SLPENR1_OFFSET 0x00b4
#define STM32_RCC_AHB2SLPENR2_OFFSET 0x00b8
#define STM32_RCC_AHB1SLPENR2_OFFSET 0x00bc
#define STM32_RCC_APB1SLPENR1_OFFSET 0x00c4
#define STM32_RCC_APB1SLPENR2_OFFSET 0x00c8
#define STM32_RCC_APB2SLPENR_OFFSET  0x00cc
#define STM32_RCC_APB3SLPENR_OFFSET  0x00d0
#define STM32_RCC_AHB1STPENR1_OFFSET 0x00d8
#define STM32_RCC_AHB2STPENR1_OFFSET 0x00dc
#define STM32_RCC_APB1STPENR1_OFFSET 0x00ec
#define STM32_RCC_APB1STPENR2_OFFSET 0x00f0
#define STM32_RCC_APB2STPENR_OFFSET  0x00f4
#define STM32_RCC_APB3STPENR_OFFSET  0x00f8
#define STM32_RCC_CCIPR1_OFFSET      0x0100
#define STM32_RCC_CCIPR2_OFFSET      0x0104
#define STM32_RCC_CCIPR3_OFFSET      0x0108
#define STM32_RCC_BDCR_OFFSET        0x0110
#define STM32_RCC_CSR_OFFSET         0x0114
#define STM32_RCC_SECCFGR_OFFSET     0x0130
#define STM32_RCC_PRIVCFGR_OFFSET    0x0134

/* Register Addresses *******************************************************/

#define STM32_RCC_CR          (STM32_RCC_BASE + STM32_RCC_CR_OFFSET)
#define STM32_RCC_ICSCR1      (STM32_RCC_BASE + STM32_RCC_ICSCR1_OFFSET)
#define STM32_RCC_ICSCR2      (STM32_RCC_BASE + STM32_RCC_ICSCR2_OFFSET)
#define STM32_RCC_ICSCR3      (STM32_RCC_BASE + STM32_RCC_ICSCR3_OFFSET)
#define STM32_RCC_CRRCR       (STM32_RCC_BASE + STM32_RCC_CRRCR_OFFSET)
#define STM32_RCC_CFGR1       (STM32_RCC_BASE + STM32_RCC_CFGR1_OFFSET)
#define STM32_RCC_CFGR2       (STM32_RCC_BASE + STM32_RCC_CFGR2_OFFSET)
#define STM32_RCC_CFGR3       (STM32_RCC_BASE + STM32_RCC_CFGR3_OFFSET)
#define STM32_RCC_CFGR4       (STM32_RCC_BASE + STM32_RCC_CFGR4_OFFSET)
#define STM32_RCC_CIER        (STM32_RCC_BASE + STM32_RCC_CIER_OFFSET)
#define STM32_RCC_CIFR        (STM32_RCC_BASE + STM32_RCC_CIFR_OFFSET)
#define STM32_RCC_CICR        (STM32_RCC_BASE + STM32_RCC_CICR_OFFSET)
#define STM32_RCC_AHB1RSTR1   (STM32_RCC_BASE + STM32_RCC_AHB1RSTR1_OFFSET)
#define STM32_RCC_AHB2RSTR1   (STM32_RCC_BASE + STM32_RCC_AHB2RSTR1_OFFSET)
#define STM32_RCC_AHB2RSTR2   (STM32_RCC_BASE + STM32_RCC_AHB2RSTR2_OFFSET)
#define STM32_RCC_APB1RSTR1   (STM32_RCC_BASE + STM32_RCC_APB1RSTR1_OFFSET)
#define STM32_RCC_APB1RSTR2   (STM32_RCC_BASE + STM32_RCC_APB1RSTR2_OFFSET)
#define STM32_RCC_APB2RSTR    (STM32_RCC_BASE + STM32_RCC_APB2RSTR_OFFSET)
#define STM32_RCC_APB3RSTR    (STM32_RCC_BASE + STM32_RCC_APB3RSTR_OFFSET)
#define STM32_RCC_AHB1ENR1    (STM32_RCC_BASE + STM32_RCC_AHB1ENR1_OFFSET)
#define STM32_RCC_AHB2ENR1    (STM32_RCC_BASE + STM32_RCC_AHB2ENR1_OFFSET)
#define STM32_RCC_AHB2ENR2    (STM32_RCC_BASE + STM32_RCC_AHB2ENR2_OFFSET)
#define STM32_RCC_AHB1ENR2    (STM32_RCC_BASE + STM32_RCC_AHB1ENR2_OFFSET)
#define STM32_RCC_APB1ENR1    (STM32_RCC_BASE + STM32_RCC_APB1ENR1_OFFSET)
#define STM32_RCC_APB1ENR2    (STM32_RCC_BASE + STM32_RCC_APB1ENR2_OFFSET)
#define STM32_RCC_APB2ENR     (STM32_RCC_BASE + STM32_RCC_APB2ENR_OFFSET)
#define STM32_RCC_APB3ENR     (STM32_RCC_BASE + STM32_RCC_APB3ENR_OFFSET)
#define STM32_RCC_AHB1SLPENR1 (STM32_RCC_BASE + STM32_RCC_AHB1SLPENR1_OFFSET)
#define STM32_RCC_AHB2SLPENR1 (STM32_RCC_BASE + STM32_RCC_AHB2SLPENR1_OFFSET)
#define STM32_RCC_AHB2SLPENR2 (STM32_RCC_BASE + STM32_RCC_AHB2SLPENR2_OFFSET)
#define STM32_RCC_AHB1SLPENR2 (STM32_RCC_BASE + STM32_RCC_AHB1SLPENR2_OFFSET)
#define STM32_RCC_APB1SLPENR1 (STM32_RCC_BASE + STM32_RCC_APB1SLPENR1_OFFSET)
#define STM32_RCC_APB1SLPENR2 (STM32_RCC_BASE + STM32_RCC_APB1SLPENR2_OFFSET)
#define STM32_RCC_APB2SLPENR  (STM32_RCC_BASE + STM32_RCC_APB2SLPENR_OFFSET)
#define STM32_RCC_APB3SLPENR  (STM32_RCC_BASE + STM32_RCC_APB3SLPENR_OFFSET)
#define STM32_RCC_AHB1STPENR1 (STM32_RCC_BASE + STM32_RCC_AHB1STPENR1_OFFSET)
#define STM32_RCC_AHB2STPENR1 (STM32_RCC_BASE + STM32_RCC_AHB2STPENR1_OFFSET)
#define STM32_RCC_APB1STPENR1 (STM32_RCC_BASE + STM32_RCC_APB1STPENR1_OFFSET)
#define STM32_RCC_APB1STPENR2 (STM32_RCC_BASE + STM32_RCC_APB1STPENR2_OFFSET)
#define STM32_RCC_APB2STPENR  (STM32_RCC_BASE + STM32_RCC_APB2STPENR_OFFSET)
#define STM32_RCC_APB3STPENR  (STM32_RCC_BASE + STM32_RCC_APB3STPENR_OFFSET)
#define STM32_RCC_CCIPR1      (STM32_RCC_BASE + STM32_RCC_CCIPR1_OFFSET)
#define STM32_RCC_CCIPR2      (STM32_RCC_BASE + STM32_RCC_CCIPR2_OFFSET)
#define STM32_RCC_CCIPR3      (STM32_RCC_BASE + STM32_RCC_CCIPR3_OFFSET)
#define STM32_RCC_BDCR        (STM32_RCC_BASE + STM32_RCC_BDCR_OFFSET)
#define STM32_RCC_CSR         (STM32_RCC_BASE + STM32_RCC_CSR_OFFSET)
#define STM32_RCC_SECCFGR     (STM32_RCC_BASE + STM32_RCC_SECCFGR_OFFSET)
#define STM32_RCC_PRIVCFGR    (STM32_RCC_BASE + STM32_RCC_PRIVCFGR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* RCC clock control register */

#define RCC_CR_RESET                  0x0000001d
#define RCC_CR_MSISON                 (1 << 0)
#define RCC_CR_MSIKERON               (1 << 1)
#define RCC_CR_MSISRDY                (1 << 2)
#define RCC_CR_MSIKON                 (1 << 3)
#define RCC_CR_MSIKRDY                (1 << 4)
#define RCC_CR_MSIPLL1EN              (1 << 5)
#define RCC_CR_MSIPLL0EN              (1 << 6)
#define RCC_CR_MSIPLL1FAST            (1 << 7)
#define RCC_CR_MSIPLL0FAST            (1 << 8)
#define RCC_CR_MSIPLL1RDY             (1 << 9)
#define RCC_CR_MSIPLL0RDY             (1 << 10)
#define RCC_CR_HSION                  (1 << 11)
#define RCC_CR_HSIKERON               (1 << 12)
#define RCC_CR_HSIRDY                 (1 << 13)
#define RCC_CR_HSI48ON                (1 << 14)
#define RCC_CR_HSI48RDY               (1 << 15)
#define RCC_CR_HSEON                  (1 << 16)
#define RCC_CR_HSERDY                 (1 << 17)
#define RCC_CR_HSEBYP                 (1 << 18)
#define RCC_CR_HSECSSON               (1 << 19)
#define RCC_CR_HSEEXT                 (1 << 20)

/* RCC internal clock source calibration register 1 */

#define RCC_ICSCR1_RESET              0xb4000000
#define RCC_ICSCR1_MSICAL1_SHIFT      (0)
#define RCC_ICSCR1_MSICAL1_MASK       (0x3f << RCC_ICSCR1_MSICAL1_SHIFT)
#define RCC_ICSCR1_MSICAL1(n)         ((n) << RCC_ICSCR1_MSICAL1_SHIFT)
#define RCC_ICSCR1_MSICAL0_SHIFT      (6)
#define RCC_ICSCR1_MSICAL0_MASK       (0x3f << RCC_ICSCR1_MSICAL0_SHIFT)
#define RCC_ICSCR1_MSICAL0(n)         ((n) << RCC_ICSCR1_MSICAL0_SHIFT)
#define RCC_ICSCR1_MSIHSINDIV         (1 << 19)
#define RCC_ICSCR1_MSIPLL1SEL         (1 << 20)
#define RCC_ICSCR1_MSIPLL0SEL         (1 << 21)
#define RCC_ICSCR1_MSIBIAS            (1 << 22)
#define RCC_ICSCR1_MSIRGSEL           (1 << 23)
#define RCC_ICSCR1_MSIPLL1N_SHIFT     (24)
#define RCC_ICSCR1_MSIPLL1N_MASK      (0x3 << RCC_ICSCR1_MSIPLL1N_SHIFT)
#define RCC_ICSCR1_MSIPLL1N(n)        ((n) << RCC_ICSCR1_MSIPLL1N_SHIFT)
#define RCC_ICSCR1_MSIKDIV_SHIFT      (26)
#define RCC_ICSCR1_MSIKDIV_MASK       (0x3 << RCC_ICSCR1_MSIKDIV_SHIFT)
#define RCC_ICSCR1_MSIKDIV(n)         ((n) << RCC_ICSCR1_MSIKDIV_SHIFT)
#  define RCC_ICSCR1_MSIKDIV_DIV1     RCC_ICSCR1_MSIKDIV(0)
#  define RCC_ICSCR1_MSIKDIV_DIV2     RCC_ICSCR1_MSIKDIV(1)
#  define RCC_ICSCR1_MSIKDIV_DIV4     RCC_ICSCR1_MSIKDIV(2)
#  define RCC_ICSCR1_MSIKDIV_DIV8     RCC_ICSCR1_MSIKDIV(3)
#define RCC_ICSCR1_MSIKSEL            (1 << 28)
#  define RCC_ICSCR1_MSIKSEL_MSIRC0   (0)
#  define RCC_ICSCR1_MSIKSEL_MSIRC1   RCC_ICSCR1_MSIKSEL
#define RCC_ICSCR1_MSISDIV_SHIFT      (29)
#define RCC_ICSCR1_MSISDIV_MASK       (0x3 << RCC_ICSCR1_MSISDIV_SHIFT)
#define RCC_ICSCR1_MSISDIV(n)         ((n) << RCC_ICSCR1_MSISDIV_SHIFT)
#  define RCC_ICSCR1_MSISDIV_DIV1     RCC_ICSCR1_MSISDIV(0)
#  define RCC_ICSCR1_MSISDIV_DIV2     RCC_ICSCR1_MSISDIV(1)
#  define RCC_ICSCR1_MSISDIV_DIV4     RCC_ICSCR1_MSISDIV(2)
#  define RCC_ICSCR1_MSISDIV_DIV8     RCC_ICSCR1_MSISDIV(3)
#define RCC_ICSCR1_MSISSEL            (1 << 31)
#  define RCC_ICSCR1_MSISSEL_MSIRC0   (0)
#  define RCC_ICSCR1_MSISSEL_MSIRC1   RCC_ICSCR1_MSISSEL

/* RCC internal clock source calibration register 2 */

