apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_rcc.h
#define RCC_ICSCR2_RESET              0x00000820
#define RCC_ICSCR2_MSITRIM1_SHIFT     (0)
#define RCC_ICSCR2_MSITRIM1_MASK      (0x3f << RCC_ICSCR2_MSITRIM1_SHIFT)
#define RCC_ICSCR2_MSITRIM1(n)        ((n) << RCC_ICSCR2_MSITRIM1_SHIFT)
#define RCC_ICSCR2_MSITRIM0_SHIFT     (6)
#define RCC_ICSCR2_MSITRIM0_MASK      (0x3f << RCC_ICSCR2_MSITRIM0_SHIFT)
#define RCC_ICSCR2_MSITRIM0(n)        ((n) << RCC_ICSCR2_MSITRIM0_SHIFT)

/* RCC internal clock source calibration register 3 */

#define RCC_ICSCR3_RESET              0x00100000
#define RCC_ICSCR3_HSICAL_SHIFT       (0)
#define RCC_ICSCR3_HSICAL_MASK        (0xfff << RCC_ICSCR3_HSICAL_SHIFT)
#define RCC_ICSCR3_HSICAL(n)          ((n) << RCC_ICSCR3_HSICAL_SHIFT)
#define RCC_ICSCR3_HSITRIM_SHIFT      (16)
#define RCC_ICSCR3_HSITRIM_MASK       (0x1f << RCC_ICSCR3_HSITRIM_SHIFT)
#define RCC_ICSCR3_HSITRIM(n)         ((n) << RCC_ICSCR3_HSITRIM_SHIFT)

/* RCC clock recovery RC register */

#define RCC_CRRCR_RESET               0x00000000
#define RCC_CRRCR_HSI48CAL_SHIFT      (0)
#define RCC_CRRCR_HSI48CAL_MASK       (0x1ff << RCC_CRRCR_HSI48CAL_SHIFT)
#define RCC_CRRCR_HSI48CAL(n)         ((n) << RCC_CRRCR_HSI48CAL_SHIFT)

/* RCC clock configuration register 1 */

#define RCC_CFGR1_RESET               0x00000000
#define RCC_CFGR1_SW_SHIFT            (0)
#define RCC_CFGR1_SW_MASK             (0x3 << RCC_CFGR1_SW_SHIFT)
#define RCC_CFGR1_SW(n)               ((n) << RCC_CFGR1_SW_SHIFT)
#  define RCC_CFGR1_SW_MSIS           RCC_CFGR1_SW(0)
#  define RCC_CFGR1_SW_HSI            RCC_CFGR1_SW(1)
#  define RCC_CFGR1_SW_HSE            RCC_CFGR1_SW(2)
#define RCC_CFGR1_SWS_SHIFT           (2)
#define RCC_CFGR1_SWS_MASK            (0x3 << RCC_CFGR1_SWS_SHIFT)
#define RCC_CFGR1_SWS(n)              ((n) << RCC_CFGR1_SWS_SHIFT)
#  define RCC_CFGR1_SWS_MSIS          RCC_CFGR1_SWS(0)
#  define RCC_CFGR1_SWS_HSI           RCC_CFGR1_SWS(1)
#  define RCC_CFGR1_SWS_HSE           RCC_CFGR1_SWS(2)
#define RCC_CFGR1_STOPWUCK            (1 << 4)
#  define RCC_CFGR1_STOPWUCK_MSIS     (0)
#  define RCC_CFGR1_STOPWUCK_HSI      RCC_CFGR1_STOPWUCK
#define RCC_CFGR1_STOPKERWUCK         (1 << 5)
#  define RCC_CFGR1_STOPKERWUCK_MSIK  (0)
#  define RCC_CFGR1_STOPKERWUCK_HSI   RCC_CFGR1_STOPKERWUCK
#define RCC_CFGR1_MCO2SEL_SHIFT       (16)
#define RCC_CFGR1_MCO2SEL_MASK        (0xf << RCC_CFGR1_MCO2SEL_SHIFT)
#define RCC_CFGR1_MCO2SEL(n)          ((n) << RCC_CFGR1_MCO2SEL_SHIFT)
#  define RCC_CFGR1_MCO2SEL_NONE      RCC_CFGR1_MCO2SEL(0)
#  define RCC_CFGR1_MCO2SEL_SYSCLK    RCC_CFGR1_MCO2SEL(1)
#  define RCC_CFGR1_MCO2SEL_MSIS      RCC_CFGR1_MCO2SEL(2)
#  define RCC_CFGR1_MCO2SEL_HSI       RCC_CFGR1_MCO2SEL(3)
#  define RCC_CFGR1_MCO2SEL_HSE       RCC_CFGR1_MCO2SEL(4)
#  define RCC_CFGR1_MCO2SEL_LSI       RCC_CFGR1_MCO2SEL(5)
#  define RCC_CFGR1_MCO2SEL_LSE       RCC_CFGR1_MCO2SEL(6)
#  define RCC_CFGR1_MCO2SEL_HSI48     RCC_CFGR1_MCO2SEL(7)
#  define RCC_CFGR1_MCO2SEL_MSIK      RCC_CFGR1_MCO2SEL(8)
#define RCC_CFGR1_MCO2PRE_SHIFT       (20)
#define RCC_CFGR1_MCO2PRE_MASK        (0x7 << RCC_CFGR1_MCO2PRE_SHIFT)
#define RCC_CFGR1_MCO2PRE(n)          ((n) << RCC_CFGR1_MCO2PRE_SHIFT)
#  define RCC_CFGR1_MCO2PRE_DIV1      RCC_CFGR1_MCO2PRE(0)
#  define RCC_CFGR1_MCO2PRE_DIV2      RCC_CFGR1_MCO2PRE(1)
#  define RCC_CFGR1_MCO2PRE_DIV4      RCC_CFGR1_MCO2PRE(2)
#  define RCC_CFGR1_MCO2PRE_DIV8      RCC_CFGR1_MCO2PRE(3)
#  define RCC_CFGR1_MCO2PRE_DIV16     RCC_CFGR1_MCO2PRE(4)
#  define RCC_CFGR1_MCO2PRE_DIV32     RCC_CFGR1_MCO2PRE(5)
#  define RCC_CFGR1_MCO2PRE_DIV64     RCC_CFGR1_MCO2PRE(6)
#  define RCC_CFGR1_MCO2PRE_DIV128    RCC_CFGR1_MCO2PRE(7)
#define RCC_CFGR1_MCOSEL_SHIFT        (24)
#define RCC_CFGR1_MCOSEL_MASK         (0xf << RCC_CFGR1_MCOSEL_SHIFT)
#define RCC_CFGR1_MCOSEL(n)           ((n) << RCC_CFGR1_MCOSEL_SHIFT)
#  define RCC_CFGR1_MCOSEL_NONE       RCC_CFGR1_MCOSEL(0)
#  define RCC_CFGR1_MCOSEL_SYSCLK     RCC_CFGR1_MCOSEL(1)
#  define RCC_CFGR1_MCOSEL_MSIS       RCC_CFGR1_MCOSEL(2)
#  define RCC_CFGR1_MCOSEL_HSI        RCC_CFGR1_MCOSEL(3)
#  define RCC_CFGR1_MCOSEL_HSE        RCC_CFGR1_MCOSEL(4)
#  define RCC_CFGR1_MCOSEL_LSI        RCC_CFGR1_MCOSEL(5)
#  define RCC_CFGR1_MCOSEL_LSE        RCC_CFGR1_MCOSEL(6)
#  define RCC_CFGR1_MCOSEL_HSI48      RCC_CFGR1_MCOSEL(7)
#  define RCC_CFGR1_MCOSEL_MSIK       RCC_CFGR1_MCOSEL(8)
#define RCC_CFGR1_MCOPRE_SHIFT        (28)
#define RCC_CFGR1_MCOPRE_MASK         (0x7 << RCC_CFGR1_MCOPRE_SHIFT)
#define RCC_CFGR1_MCOPRE(n)           ((n) << RCC_CFGR1_MCOPRE_SHIFT)
#  define RCC_CFGR1_MCOPRE_DIV1       RCC_CFGR1_MCOPRE(0)
#  define RCC_CFGR1_MCOPRE_DIV2       RCC_CFGR1_MCOPRE(1)
#  define RCC_CFGR1_MCOPRE_DIV4       RCC_CFGR1_MCOPRE(2)
#  define RCC_CFGR1_MCOPRE_DIV8       RCC_CFGR1_MCOPRE(3)
#  define RCC_CFGR1_MCOPRE_DIV16      RCC_CFGR1_MCOPRE(4)
#  define RCC_CFGR1_MCOPRE_DIV32      RCC_CFGR1_MCOPRE(5)
#  define RCC_CFGR1_MCOPRE_DIV64      RCC_CFGR1_MCOPRE(6)
#  define RCC_CFGR1_MCOPRE_DIV128     RCC_CFGR1_MCOPRE(7)

/* RCC clock configuration register 2 */

#define RCC_CFGR2_RESET               0x00000000
#define RCC_CFGR2_HPRE_SHIFT          (0)
#define RCC_CFGR2_HPRE_MASK           (0xf << RCC_CFGR2_HPRE_SHIFT)
#define RCC_CFGR2_HPRE(n)             ((n) << RCC_CFGR2_HPRE_SHIFT)
#  define RCC_CFGR2_HPRE_SYSCLK       RCC_CFGR2_HPRE(0)
#  define RCC_CFGR2_HPRE_DIV2         RCC_CFGR2_HPRE(8)
#  define RCC_CFGR2_HPRE_DIV4         RCC_CFGR2_HPRE(9)
#  define RCC_CFGR2_HPRE_DIV8         RCC_CFGR2_HPRE(10)
#  define RCC_CFGR2_HPRE_DIV16        RCC_CFGR2_HPRE(11)
#  define RCC_CFGR2_HPRE_DIV64        RCC_CFGR2_HPRE(12)
#  define RCC_CFGR2_HPRE_DIV128       RCC_CFGR2_HPRE(13)
#  define RCC_CFGR2_HPRE_DIV256       RCC_CFGR2_HPRE(14)
#  define RCC_CFGR2_HPRE_DIV512       RCC_CFGR2_HPRE(15)
#define RCC_CFGR2_PPRE1_SHIFT         (4)
#define RCC_CFGR2_PPRE1_MASK          (0x7 << RCC_CFGR2_PPRE1_SHIFT)
#define RCC_CFGR2_PPRE1(n)            ((n) << RCC_CFGR2_PPRE1_SHIFT)
#  define RCC_CFGR2_PPRE1_HCLK        RCC_CFGR2_PPRE1(0)
#  define RCC_CFGR2_PPRE1_DIV2        RCC_CFGR2_PPRE1(4)
#  define RCC_CFGR2_PPRE1_DIV4        RCC_CFGR2_PPRE1(5)
#  define RCC_CFGR2_PPRE1_DIV8        RCC_CFGR2_PPRE1(6)
#  define RCC_CFGR2_PPRE1_DIV16       RCC_CFGR2_PPRE1(7)
#define RCC_CFGR2_PPRE2_SHIFT         (8)
#define RCC_CFGR2_PPRE2_MASK          (0x7 << RCC_CFGR2_PPRE2_SHIFT)
#define RCC_CFGR2_PPRE2(n)            ((n) << RCC_CFGR2_PPRE2_SHIFT)
#  define RCC_CFGR2_PPRE2_HCLK        RCC_CFGR2_PPRE2(0)
#  define RCC_CFGR2_PPRE2_DIV2        RCC_CFGR2_PPRE2(4)
#  define RCC_CFGR2_PPRE2_DIV4        RCC_CFGR2_PPRE2(5)
#  define RCC_CFGR2_PPRE2_DIV8        RCC_CFGR2_PPRE2(6)
#  define RCC_CFGR2_PPRE2_DIV16       RCC_CFGR2_PPRE2(7)

/* RCC clock configuration register 3 */

#define RCC_CFGR3_RESET               0x00000000
#define RCC_CFGR3_PPRE3_SHIFT         (4)
#define RCC_CFGR3_PPRE3_MASK          (0x7 << RCC_CFGR3_PPRE3_SHIFT)
#define RCC_CFGR3_PPRE3(n)            ((n) << RCC_CFGR3_PPRE3_SHIFT)
#  define RCC_CFGR3_PPRE3_HCLK        RCC_CFGR3_PPRE3(0)
#  define RCC_CFGR3_PPRE3_DIV2        RCC_CFGR3_PPRE3(4)
#  define RCC_CFGR3_PPRE3_DIV4        RCC_CFGR3_PPRE3(5)
#  define RCC_CFGR3_PPRE3_DIV8        RCC_CFGR3_PPRE3(6)
#  define RCC_CFGR3_PPRE3_DIV16       RCC_CFGR3_PPRE3(7)

/* RCC clock configuration register 4 */

#define RCC_CFGR4_RESET               0x00000000
#define RCC_CFGR4_BOOSTSEL_SHIFT      (0)
#define RCC_CFGR4_BOOSTSEL_MASK       (0x3 << RCC_CFGR4_BOOSTSEL_SHIFT)
#define RCC_CFGR4_BOOSTSEL(n)         ((n) << RCC_CFGR4_BOOSTSEL_SHIFT)
#  define RCC_CFGR4_BOOSTSEL_NONE     RCC_CFGR4_BOOSTSEL(0)
#  define RCC_CFGR4_BOOSTSEL_MSIS     RCC_CFGR4_BOOSTSEL(1)
#  define RCC_CFGR4_BOOSTSEL_HSI      RCC_CFGR4_BOOSTSEL(2)
#  define RCC_CFGR4_BOOSTSEL_HSE      RCC_CFGR4_BOOSTSEL(3)
#define RCC_CFGR4_BOOSTDIV_SHIFT      (12)
#define RCC_CFGR4_BOOSTDIV_MASK       (0xf << RCC_CFGR4_BOOSTDIV_SHIFT)
#define RCC_CFGR4_BOOSTDIV(n)         ((n) << RCC_CFGR4_BOOSTDIV_SHIFT)
#  define RCC_CFGR4_BOOSTDIV_DIV1     RCC_CFGR4_BOOSTDIV(0)
#  define RCC_CFGR4_BOOSTDIV_DIV2     RCC_CFGR4_BOOSTDIV(1)
#  define RCC_CFGR4_BOOSTDIV_DIV4     RCC_CFGR4_BOOSTDIV(2)
#  define RCC_CFGR4_BOOSTDIV_DIV6     RCC_CFGR4_BOOSTDIV(3)
#  define RCC_CFGR4_BOOSTDIV_DIV8     RCC_CFGR4_BOOSTDIV(4)
#  define RCC_CFGR4_BOOSTDIV_DIV10    RCC_CFGR4_BOOSTDIV(5)
#  define RCC_CFGR4_BOOSTDIV_DIV12    RCC_CFGR4_BOOSTDIV(6)
#  define RCC_CFGR4_BOOSTDIV_DIV14    RCC_CFGR4_BOOSTDIV(7)
#  define RCC_CFGR4_BOOSTDIV_DIV16    RCC_CFGR4_BOOSTDIV(8)

