apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_rcc.h
/* RCC clock interrupt enable register */

#define RCC_CIER_RESET                0x00000000
#define RCC_CIER_LSIRDYIE             (1 << 0)
#define RCC_CIER_LSERDYIE             (1 << 1)
#define RCC_CIER_MSISRDYIE            (1 << 2)
#define RCC_CIER_HSIRDYIE             (1 << 3)
#define RCC_CIER_HSERDYIE             (1 << 4)
#define RCC_CIER_HSI48RDYIE           (1 << 5)
#define RCC_CIER_MSIPLL1RDYIE         (1 << 6)
#define RCC_CIER_MSIPLL0RDYIE         (1 << 7)
#define RCC_CIER_MSIPLLUIE            (1 << 8)
#define RCC_CIER_MSIPLLHSUIE          (1 << 9)
#define RCC_CIER_MSIKRDYIE            (1 << 11)
#define RCC_CIER_LSECSSIE             (1 << 12)

/* RCC clock interrupt flag register */

#define RCC_CIFR_RESET                0x00000000
#define RCC_CIFR_LSIRDYF              (1 << 0)
#define RCC_CIFR_LSERDYF              (1 << 1)
#define RCC_CIFR_MSISRDYF             (1 << 2)
#define RCC_CIFR_HSIRDYF              (1 << 3)
#define RCC_CIFR_HSERDYF              (1 << 4)
#define RCC_CIFR_HSI48RDYF            (1 << 5)
#define RCC_CIFR_MSIPLL1RDYF          (1 << 6)
#define RCC_CIFR_MSIPLL0RDYF          (1 << 7)
#define RCC_CIFR_MSIPLLUF             (1 << 8)
#define RCC_CIFR_MSIPLLHSUF           (1 << 9)
#define RCC_CIFR_CSSF                 (1 << 10)
#define RCC_CIFR_MSIKRDYF             (1 << 11)
#define RCC_CIFR_LSECSSF              (1 << 12)

/* RCC clock interrupt clear register */

#define RCC_CICR_RESET                0x00000000
#define RCC_CICR_LSIRDYC              (1 << 0)
#define RCC_CICR_LSERDYC              (1 << 1)
#define RCC_CICR_MSISRDYC             (1 << 2)
#define RCC_CICR_HSIRDYC              (1 << 3)
#define RCC_CICR_HSERDYC              (1 << 4)
#define RCC_CICR_HSI48RDYC            (1 << 5)
#define RCC_CICR_MSIPLL1RDYC          (1 << 6)
#define RCC_CICR_MSIPLL0RDYC          (1 << 7)
#define RCC_CICR_MSIPLLUC             (1 << 8)
#define RCC_CICR_MSIPLLHSUC           (1 << 9)
#define RCC_CICR_CSSC                 (1 << 10)
#define RCC_CICR_MSIKRDYC             (1 << 11)
#define RCC_CICR_LSECSSC              (1 << 12)

/* RCC AHB1 peripheral reset register 1 */

#define RCC_AHB1RSTR1_RESET           0x00000000
#define RCC_AHB1RSTR1_GPDMA1RST       (1 << 0)
#define RCC_AHB1RSTR1_ADF1RST         (1 << 3)
#define RCC_AHB1RSTR1_HSP1RST         (1 << 4)
#define RCC_AHB1RSTR1_CRCRST          (1 << 12)
#define RCC_AHB1RSTR1_TSCRST          (1 << 16)
#define RCC_AHB1RSTR1_RAMCFGRST       (1 << 17)

/* RCC AHB2 peripheral reset register 1 */

#define RCC_AHB2RSTR1_RESET           0x00000000
#define RCC_AHB2RSTR1_GPIOARST        (1 << 0)
#define RCC_AHB2RSTR1_GPIOBRST        (1 << 1)
#define RCC_AHB2RSTR1_GPIOCRST        (1 << 2)
#define RCC_AHB2RSTR1_GPIODRST        (1 << 3)
#define RCC_AHB2RSTR1_GPIOERST        (1 << 4)
#define RCC_AHB2RSTR1_GPIOFRST        (1 << 5)
#define RCC_AHB2RSTR1_GPIOGRST        (1 << 6)
#define RCC_AHB2RSTR1_GPIOHRST        (1 << 7)
#define RCC_AHB2RSTR1_ADC12RST        (1 << 10)
#define RCC_AHB2RSTR1_DAC1RST         (1 << 11)
#define RCC_AHB2RSTR1_AESRST          (1 << 16)
#define RCC_AHB2RSTR1_HASHRST         (1 << 17)
#define RCC_AHB2RSTR1_RNGRST          (1 << 18)
#define RCC_AHB2RSTR1_PKARST          (1 << 19)
#define RCC_AHB2RSTR1_SAESRST         (1 << 20)
#define RCC_AHB2RSTR1_CCBRST          (1 << 21)
#define RCC_AHB2RSTR1_SDMMC1RST       (1 << 27)

/* RCC AHB2 peripheral reset register 2 */

#define RCC_AHB2RSTR2_RESET           0x00000000
#define RCC_AHB2RSTR2_OCTOSPI1RST     (1 << 4)

/* RCC APB1 peripheral reset register 1 */

#define RCC_APB1RSTR1_RESET           0x00000000
#define RCC_APB1RSTR1_TIM2RST         (1 << 0)
#define RCC_APB1RSTR1_TIM3RST         (1 << 1)
#define RCC_APB1RSTR1_TIM4RST         (1 << 2)
#define RCC_APB1RSTR1_TIM6RST         (1 << 4)
#define RCC_APB1RSTR1_TIM7RST         (1 << 5)
#define RCC_APB1RSTR1_SPI3RST         (1 << 8)
#define RCC_APB1RSTR1_SPI4RST         (1 << 9)
#define RCC_APB1RSTR1_SPI2RST         (1 << 14)
#define RCC_APB1RSTR1_USART2RST       (1 << 17)
#define RCC_APB1RSTR1_USART3RST       (1 << 18)
#define RCC_APB1RSTR1_UART4RST        (1 << 19)
#define RCC_APB1RSTR1_UART5RST        (1 << 20)
#define RCC_APB1RSTR1_I2C1RST         (1 << 21)
#define RCC_APB1RSTR1_I2C2RST         (1 << 22)
#define RCC_APB1RSTR1_I3C1RST         (1 << 23)
#define RCC_APB1RSTR1_CRSRST          (1 << 24)
#define RCC_APB1RSTR1_OPAMPRST        (1 << 28)
#define RCC_APB1RSTR1_VREFRST         (1 << 29)

/* RCC APB1 peripheral reset register 2 */

#define RCC_APB1RSTR2_RESET           0x00000000
#define RCC_APB1RSTR2_I2C4RST         (1 << 1)
#define RCC_APB1RSTR2_LPTIM2RST       (1 << 5)
#define RCC_APB1RSTR2_FDCANRST        (1 << 9)

/* RCC APB2 peripheral reset register */

#define RCC_APB2RSTR_RESET            0x00000000
#define RCC_APB2RSTR_TIM1RST          (1 << 11)
#define RCC_APB2RSTR_SPI1RST          (1 << 12)
#define RCC_APB2RSTR_TIM8RST          (1 << 13)
#define RCC_APB2RSTR_USART1RST        (1 << 14)
#define RCC_APB2RSTR_TIM12RST         (1 << 15)
#define RCC_APB2RSTR_TIM15RST         (1 << 16)
#define RCC_APB2RSTR_TIM16RST         (1 << 17)
#define RCC_APB2RSTR_TIM17RST         (1 << 18)
#define RCC_APB2RSTR_SAI1RST          (1 << 21)
#define RCC_APB2RSTR_USB1RST          (1 << 24)
#define RCC_APB2RSTR_I3C2RST          (1 << 27)

/* RCC APB3 peripheral reset register */

#define RCC_APB3RSTR_RESET            0x00000000
#define RCC_APB3RSTR_SYSCFGRST        (1 << 1)
#define RCC_APB3RSTR_LPUART1RST       (1 << 6)
#define RCC_APB3RSTR_I2C3RST          (1 << 7)
#define RCC_APB3RSTR_LPTIM1RST        (1 << 11)
#define RCC_APB3RSTR_LPTIM3RST        (1 << 12)
#define RCC_APB3RSTR_LPTIM4RST        (1 << 13)
#define RCC_APB3RSTR_COMPRST          (1 << 15)

/* RCC AHB1 peripheral clock enable register 1 */

#define RCC_AHB1ENR1_RESET            0xc0000100
#define RCC_AHB1ENR1_GPDMA1EN         (1 << 0)
#define RCC_AHB1ENR1_ADF1EN           (1 << 3)
#define RCC_AHB1ENR1_HSP1EN           (1 << 4)
#define RCC_AHB1ENR1_FLASHEN          (1 << 8)
#define RCC_AHB1ENR1_CRCEN            (1 << 12)
#define RCC_AHB1ENR1_TSCEN            (1 << 16)
#define RCC_AHB1ENR1_RAMCFGEN         (1 << 17)
#define RCC_AHB1ENR1_GTZC1EN          (1 << 24)
#define RCC_AHB1ENR1_SRAM4EN          (1 << 30)
#define RCC_AHB1ENR1_SRAM1EN          (1 << 31)

/* RCC AHB2 peripheral clock enable register 1 */

#define RCC_AHB2ENR1_RESET            0xc0000000
#define RCC_AHB2ENR1_GPIOAEN          (1 << 0)
#define RCC_AHB2ENR1_GPIOBEN          (1 << 1)
#define RCC_AHB2ENR1_GPIOCEN          (1 << 2)
#define RCC_AHB2ENR1_GPIODEN          (1 << 3)
#define RCC_AHB2ENR1_GPIOEEN          (1 << 4)
#define RCC_AHB2ENR1_GPIOFEN          (1 << 5)
#define RCC_AHB2ENR1_GPIOGEN          (1 << 6)
#define RCC_AHB2ENR1_GPIOHEN          (1 << 7)
#define RCC_AHB2ENR1_ADC12EN          (1 << 10)
#define RCC_AHB2ENR1_DAC1EN           (1 << 11)
#define RCC_AHB2ENR1_AESEN            (1 << 16)
#define RCC_AHB2ENR1_HASHEN           (1 << 17)
#define RCC_AHB2ENR1_RNGEN            (1 << 18)
#define RCC_AHB2ENR1_PKAEN            (1 << 19)
#define RCC_AHB2ENR1_SAESEN           (1 << 20)
#define RCC_AHB2ENR1_CCBEN            (1 << 21)
#define RCC_AHB2ENR1_SDMMC1EN         (1 << 27)
#define RCC_AHB2ENR1_SRAM2EN          (1 << 30)
#define RCC_AHB2ENR1_SRAM3EN          (1 << 31)

/* RCC AHB2 peripheral clock enable register 2 */

#define RCC_AHB2ENR2_RESET            0x00000000
#define RCC_AHB2ENR2_OCTOSPI1EN       (1 << 4)

