apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_rcc.h
/* RCC AHB1 peripheral clock enable register 2 */

#define RCC_AHB1ENR2_RESET            0x00000000
#define RCC_AHB1ENR2_PWREN            (1 << 2)

/* RCC APB1 peripheral clock enable register 1 */

#define RCC_APB1ENR1_RESET            0x00000000
#define RCC_APB1ENR1_TIM2EN           (1 << 0)
#define RCC_APB1ENR1_TIM3EN           (1 << 1)
#define RCC_APB1ENR1_TIM4EN           (1 << 2)
#define RCC_APB1ENR1_TIM6EN           (1 << 4)
#define RCC_APB1ENR1_TIM7EN           (1 << 5)
#define RCC_APB1ENR1_SPI3EN           (1 << 8)
#define RCC_APB1ENR1_SPI4EN           (1 << 9)
#define RCC_APB1ENR1_WWDGEN           (1 << 11)
#define RCC_APB1ENR1_SPI2EN           (1 << 14)
#define RCC_APB1ENR1_USART2EN         (1 << 17)
#define RCC_APB1ENR1_USART3EN         (1 << 18)
#define RCC_APB1ENR1_UART4EN          (1 << 19)
#define RCC_APB1ENR1_UART5EN          (1 << 20)
#define RCC_APB1ENR1_I2C1EN           (1 << 21)
#define RCC_APB1ENR1_I2C2EN           (1 << 22)
#define RCC_APB1ENR1_I3C1EN           (1 << 23)
#define RCC_APB1ENR1_CRSEN            (1 << 24)
#define RCC_APB1ENR1_OPAMPEN          (1 << 28)
#define RCC_APB1ENR1_VREFEN           (1 << 29)
#define RCC_APB1ENR1_RTCAPBEN         (1 << 30)

/* RCC APB1 peripheral clock enable register 2 */

#define RCC_APB1ENR2_RESET            0x00000000
#define RCC_APB1ENR2_I2C4EN           (1 << 1)
#define RCC_APB1ENR2_LPTIM2EN         (1 << 5)
#define RCC_APB1ENR2_FDCANEN          (1 << 9)

/* RCC APB2 peripheral clock enable register */

#define RCC_APB2ENR_RESET             0x00000000
#define RCC_APB2ENR_TIM1EN            (1 << 11)
#define RCC_APB2ENR_SPI1EN            (1 << 12)
#define RCC_APB2ENR_TIM8EN            (1 << 13)
#define RCC_APB2ENR_USART1EN          (1 << 14)
#define RCC_APB2ENR_TIM12EN           (1 << 15)
#define RCC_APB2ENR_TIM15EN           (1 << 16)
#define RCC_APB2ENR_TIM16EN           (1 << 17)
#define RCC_APB2ENR_TIM17EN           (1 << 18)
#define RCC_APB2ENR_SAI1EN            (1 << 21)
#define RCC_APB2ENR_USB1EN            (1 << 24)
#define RCC_APB2ENR_I3C2EN            (1 << 27)

/* RCC APB3 peripheral clock enable register */

#define RCC_APB3ENR_RESET             0x00000000
#define RCC_APB3ENR_SYSCFGEN          (1 << 1)
#define RCC_APB3ENR_LPUART1EN         (1 << 6)
#define RCC_APB3ENR_I2C3EN            (1 << 7)
#define RCC_APB3ENR_LPTIM1EN          (1 << 11)
#define RCC_APB3ENR_LPTIM3EN          (1 << 12)
#define RCC_APB3ENR_LPTIM4EN          (1 << 13)
#define RCC_APB3ENR_COMPEN            (1 << 15)

/* RCC AHB1 peripheral clock enable in Sleep mode register */

#define RCC_AHB1SLPENR1_RESET         0xffffffff
#define RCC_AHB1SLPENR1_GPDMA1SLPEN   (1 << 0)
#define RCC_AHB1SLPENR1_ADF1SLPEN     (1 << 3)
#define RCC_AHB1SLPENR1_HSP1SLPEN     (1 << 4)
#define RCC_AHB1SLPENR1_FLASHSLPEN    (1 << 8)
#define RCC_AHB1SLPENR1_CRCSLPEN      (1 << 12)
#define RCC_AHB1SLPENR1_TSCSLPEN      (1 << 16)
#define RCC_AHB1SLPENR1_RAMCFGSLPEN   (1 << 17)
#define RCC_AHB1SLPENR1_GTZC1SLPEN    (1 << 24)
#define RCC_AHB1SLPENR1_ICACHESLPEN   (1 << 29)
#define RCC_AHB1SLPENR1_SRAM4SLPEN    (1 << 30)
#define RCC_AHB1SLPENR1_SRAM1SLPEN    (1 << 31)

/* RCC AHB2 peripheral clock enable in Sleep mode register 1 */

#define RCC_AHB2SLPENR1_RESET         0xffffffff
#define RCC_AHB2SLPENR1_GPIOASLPEN    (1 << 0)
#define RCC_AHB2SLPENR1_GPIOBSLPEN    (1 << 1)
#define RCC_AHB2SLPENR1_GPIOCSLPEN    (1 << 2)
#define RCC_AHB2SLPENR1_GPIODSLPEN    (1 << 3)
#define RCC_AHB2SLPENR1_GPIOESLPEN    (1 << 4)
#define RCC_AHB2SLPENR1_GPIOFSLPEN    (1 << 5)
#define RCC_AHB2SLPENR1_GPIOGSLPEN    (1 << 6)
#define RCC_AHB2SLPENR1_GPIOHSLPEN    (1 << 7)
#define RCC_AHB2SLPENR1_ADC12SLPEN    (1 << 10)
#define RCC_AHB2SLPENR1_DAC1SLPEN     (1 << 11)
#define RCC_AHB2SLPENR1_AESSLPEN      (1 << 16)
#define RCC_AHB2SLPENR1_HASHSLPEN     (1 << 17)
#define RCC_AHB2SLPENR1_RNGSLPEN      (1 << 18)
#define RCC_AHB2SLPENR1_PKASLPEN      (1 << 19)
#define RCC_AHB2SLPENR1_SAESSLPEN     (1 << 20)
#define RCC_AHB2SLPENR1_CCBSLPEN      (1 << 21)
#define RCC_AHB2SLPENR1_SDMMC1SLPEN   (1 << 27)
#define RCC_AHB2SLPENR1_SRAM2SLPEN    (1 << 30)
#define RCC_AHB2SLPENR1_SRAM3SLPEN    (1 << 31)

/* RCC AHB2 peripheral clock enable in Sleep mode register 2 */

#define RCC_AHB2SLPENR2_RESET         0xffffffff
#define RCC_AHB2SLPENR2_OCTOSPI1SLPEN (1 << 4)

/* RCC AHB1 peripheral clock enable in Sleep mode register 2 */

#define RCC_AHB1SLPENR2_RESET         0xffffffff
#define RCC_AHB1SLPENR2_PWRSLPEN      (1 << 2)

/* RCC APB1 peripheral clock enable in Sleep mode register 1 */

#define RCC_APB1SLPENR1_RESET         0xffffffff
#define RCC_APB1SLPENR1_TIM2SLPEN     (1 << 0)
#define RCC_APB1SLPENR1_TIM3SLPEN     (1 << 1)
#define RCC_APB1SLPENR1_TIM4SLPEN     (1 << 2)
#define RCC_APB1SLPENR1_TIM6SLPEN     (1 << 4)
#define RCC_APB1SLPENR1_TIM7SLPEN     (1 << 5)
#define RCC_APB1SLPENR1_SPI3SLPEN     (1 << 8)
#define RCC_APB1SLPENR1_SPI4SLPEN     (1 << 9)
#define RCC_APB1SLPENR1_WWDGSLPEN     (1 << 11)
#define RCC_APB1SLPENR1_SPI2SLPEN     (1 << 14)
#define RCC_APB1SLPENR1_USART2SLPEN   (1 << 17)
#define RCC_APB1SLPENR1_USART3SLPEN   (1 << 18)
#define RCC_APB1SLPENR1_UART4SLPEN    (1 << 19)
#define RCC_APB1SLPENR1_UART5SLPEN    (1 << 20)
#define RCC_APB1SLPENR1_I2C1SLPEN     (1 << 21)
#define RCC_APB1SLPENR1_I2C2SLPEN     (1 << 22)
#define RCC_APB1SLPENR1_I3C1SLPEN     (1 << 23)
#define RCC_APB1SLPENR1_CRSSLPEN      (1 << 24)
#define RCC_APB1SLPENR1_OPAMPSLPEN    (1 << 28)
#define RCC_APB1SLPENR1_VREFSLPEN     (1 << 29)
#define RCC_APB1SLPENR1_RTCAPBSLPEN   (1 << 30)

/* RCC APB1 peripheral clock enable in Sleep mode register 2 */

#define RCC_APB1SLPENR2_RESET         0xffffffff
#define RCC_APB1SLPENR2_I2C4SLPEN     (1 << 1)
#define RCC_APB1SLPENR2_LPTIM2SLPEN   (1 << 5)
#define RCC_APB1SLPENR2_FDCANSLPEN    (1 << 9)

/* RCC APB2 peripheral clock enable in Sleep mode register */

#define RCC_APB2SLPENR_RESET          0xffffffff
#define RCC_APB2SLPENR_TIM1SLPEN      (1 << 11)
#define RCC_APB2SLPENR_SPI1SLPEN      (1 << 12)
#define RCC_APB2SLPENR_TIM8SLPEN      (1 << 13)
#define RCC_APB2SLPENR_USART1SLPEN    (1 << 14)
#define RCC_APB2SLPENR_TIM12SLPEN     (1 << 15)
#define RCC_APB2SLPENR_TIM15SLPEN     (1 << 16)
#define RCC_APB2SLPENR_TIM16SLPEN     (1 << 17)
#define RCC_APB2SLPENR_TIM17SLPEN     (1 << 18)
#define RCC_APB2SLPENR_SAI1SLPEN      (1 << 21)
#define RCC_APB2SLPENR_USB1SLPEN      (1 << 24)
#define RCC_APB2SLPENR_I3C2SLPEN      (1 << 27)

