apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_rcc.h
/* RCC APB3 peripheral clock enable in Sleep mode register */

#define RCC_APB3SLPENR_RESET          0xffffffff
#define RCC_APB3SLPENR_SYSCFGSLPEN    (1 << 1)
#define RCC_APB3SLPENR_LPUART1SLPEN   (1 << 6)
#define RCC_APB3SLPENR_I2C3SLPEN      (1 << 7)
#define RCC_APB3SLPENR_LPTIM1SLPEN    (1 << 11)
#define RCC_APB3SLPENR_LPTIM3SLPEN    (1 << 12)
#define RCC_APB3SLPENR_LPTIM4SLPEN    (1 << 13)
#define RCC_APB3SLPENR_COMPSLPEN      (1 << 15)

/* RCC AHB1 peripheral clock enable in Stop mode register */

#define RCC_AHB1STPENR1_RESET         0xffffffff
#define RCC_AHB1STPENR1_GPDMA1STPEN   (1 << 0)
#define RCC_AHB1STPENR1_ADF1STPEN     (1 << 3)
#define RCC_AHB1STPENR1_FLASHSTPEN    (1 << 8)
#define RCC_AHB1STPENR1_RAMCFGSTPEN   (1 << 17)
#define RCC_AHB1STPENR1_GTZC1STPEN    (1 << 24)
#define RCC_AHB1STPENR1_SRAM4STPEN    (1 << 30)
#define RCC_AHB1STPENR1_SRAM1STPEN    (1 << 31)

/* RCC AHB2 peripheral clock enable in Stop mode register 1 */

#define RCC_AHB2STPENR1_RESET         0xffffffff
#define RCC_AHB2STPENR1_GPIOASTPEN    (1 << 0)
#define RCC_AHB2STPENR1_GPIOBSTPEN    (1 << 1)
#define RCC_AHB2STPENR1_GPIOCSTPEN    (1 << 2)
#define RCC_AHB2STPENR1_GPIODSTPEN    (1 << 3)
#define RCC_AHB2STPENR1_GPIOESTPEN    (1 << 4)
#define RCC_AHB2STPENR1_GPIOFSTPEN    (1 << 5)
#define RCC_AHB2STPENR1_GPIOGSTPEN    (1 << 6)
#define RCC_AHB2STPENR1_GPIOHSTPEN    (1 << 7)
#define RCC_AHB2STPENR1_DAC1STPEN     (1 << 11)
#define RCC_AHB2STPENR1_SRAM2STPEN    (1 << 30)
#define RCC_AHB2STPENR1_SRAM3STPEN    (1 << 31)

/* RCC APB1 peripheral clock enable in Stop mode register 1 */

#define RCC_APB1STPENR1_RESET         0xffffffff
#define RCC_APB1STPENR1_SPI3STPEN     (1 << 8)
#define RCC_APB1STPENR1_SPI4STPEN     (1 << 9)
#define RCC_APB1STPENR1_SPI2STPEN     (1 << 14)
#define RCC_APB1STPENR1_USART2STPEN   (1 << 17)
#define RCC_APB1STPENR1_USART3STPEN   (1 << 18)
#define RCC_APB1STPENR1_UART4STPEN    (1 << 19)
#define RCC_APB1STPENR1_UART5STPEN    (1 << 20)
#define RCC_APB1STPENR1_I2C1STPEN     (1 << 21)
#define RCC_APB1STPENR1_I2C2STPEN     (1 << 22)
#define RCC_APB1STPENR1_I3C1STPEN     (1 << 23)
#define RCC_APB1STPENR1_OPAMPSTPEN    (1 << 28)
#define RCC_APB1STPENR1_VREFSTPEN     (1 << 29)
#define RCC_APB1STPENR1_RTCAPBSTPEN   (1 << 30)

/* RCC APB1 peripheral clock enable in Stop mode register 2 */

#define RCC_APB1STPENR2_RESET         0xffffffff
#define RCC_APB1STPENR2_I2C4STPEN     (1 << 1)
#define RCC_APB1STPENR2_LPTIM2STPEN   (1 << 5)

/* RCC APB2 peripheral clock enable in Stop mode register */

#define RCC_APB2STPENR_RESET          0xffffffff
#define RCC_APB2STPENR_SPI1STPEN      (1 << 12)
#define RCC_APB2STPENR_USART1STPEN    (1 << 14)
#define RCC_APB2STPENR_USB1STPEN      (1 << 24)
#define RCC_APB2STPENR_I3C2STPEN      (1 << 27)

/* RCC APB3 peripheral clock enable in Stop mode register */

#define RCC_APB3STPENR_RESET          0xffffffff
#define RCC_APB3STPENR_LPUART1STPEN   (1 << 6)
#define RCC_APB3STPENR_I2C3STPEN      (1 << 7)
#define RCC_APB3STPENR_LPTIM1STPEN    (1 << 11)
#define RCC_APB3STPENR_LPTIM3STPEN    (1 << 12)
#define RCC_APB3STPENR_LPTIM4STPEN    (1 << 13)
#define RCC_APB3STPENR_COMPSTPEN      (1 << 15)

/* RCC peripheral independent clock configuration register 1 */

#define RCC_CCIPR1_RESET              0x00000000
#define RCC_CCIPR1_USART1SEL          (1 << 0)
#  define RCC_CCIPR1_USART1SEL_PCLK2  (0)
#  define RCC_CCIPR1_USART1SEL_HSI    RCC_CCIPR1_USART1SEL
#define RCC_CCIPR1_USART3SEL          (1 << 2)
#  define RCC_CCIPR1_USART3SEL_PCLK1  (0)
#  define RCC_CCIPR1_USART3SEL_HSI    RCC_CCIPR1_USART3SEL
#define RCC_CCIPR1_UART4SEL           (1 << 4)
#  define RCC_CCIPR1_UART4SEL_PCLK1   (0)
#  define RCC_CCIPR1_UART4SEL_HSI     RCC_CCIPR1_UART4SEL
#define RCC_CCIPR1_UART5SEL           (1 << 6)
#  define RCC_CCIPR1_UART5SEL_PCLK1   (0)
#  define RCC_CCIPR1_UART5SEL_HSI     RCC_CCIPR1_UART5SEL
#define RCC_CCIPR1_I3C1SEL            (1 << 8)
#  define RCC_CCIPR1_I3C1SEL_PCLK1    (0)
#  define RCC_CCIPR1_I3C1SEL_MSIK     RCC_CCIPR1_I3C1SEL
#define RCC_CCIPR1_I2C1SEL            (1 << 10)
#  define RCC_CCIPR1_I2C1SEL_PCLK1    (0)
#  define RCC_CCIPR1_I2C1SEL_MSIK     RCC_CCIPR1_I2C1SEL
#define RCC_CCIPR1_I2C2SEL            (1 << 12)
#  define RCC_CCIPR1_I2C2SEL_PCLK1    (0)
#  define RCC_CCIPR1_I2C2SEL_MSIK     RCC_CCIPR1_I2C2SEL
#define RCC_CCIPR1_I3C2SEL            (1 << 14)
#  define RCC_CCIPR1_I3C2SEL_PCLK2    (0)
#  define RCC_CCIPR1_I3C2SEL_MSIK     RCC_CCIPR1_I3C2SEL
#define RCC_CCIPR1_SPI2SEL            (1 << 16)
#  define RCC_CCIPR1_SPI2SEL_PCLK1    (0)
#  define RCC_CCIPR1_SPI2SEL_MSIK     RCC_CCIPR1_SPI2SEL
#define RCC_CCIPR1_LPTIM2SEL_SHIFT    (18)
#define RCC_CCIPR1_LPTIM2SEL_MASK     (0x3 << RCC_CCIPR1_LPTIM2SEL_SHIFT)
#define RCC_CCIPR1_LPTIM2SEL(n)       ((n) << RCC_CCIPR1_LPTIM2SEL_SHIFT)
#  define RCC_CCIPR1_LPTIM2SEL_PCLK1  RCC_CCIPR1_LPTIM2SEL(0)
#  define RCC_CCIPR1_LPTIM2SEL_LSI    RCC_CCIPR1_LPTIM2SEL(1)
#  define RCC_CCIPR1_LPTIM2SEL_HSI    RCC_CCIPR1_LPTIM2SEL(2)
#  define RCC_CCIPR1_LPTIM2SEL_LSE    RCC_CCIPR1_LPTIM2SEL(3)
#define RCC_CCIPR1_SPI1SEL            (1 << 20)
#  define RCC_CCIPR1_SPI1SEL_PCLK2    (0)
#  define RCC_CCIPR1_SPI1SEL_MSIK     RCC_CCIPR1_SPI1SEL
#define RCC_CCIPR1_SYSTICKSEL_SHIFT   (22)
#define RCC_CCIPR1_SYSTICKSEL_MASK    (0x3 << RCC_CCIPR1_SYSTICKSEL_SHIFT)
#define RCC_CCIPR1_SYSTICKSEL(n)      ((n) << RCC_CCIPR1_SYSTICKSEL_SHIFT)
#  define RCC_CCIPR1_SYSTICKSEL_HCLK8 RCC_CCIPR1_SYSTICKSEL(0)
#  define RCC_CCIPR1_SYSTICKSEL_LSI   RCC_CCIPR1_SYSTICKSEL(1)
#  define RCC_CCIPR1_SYSTICKSEL_LSE   RCC_CCIPR1_SYSTICKSEL(2)
#define RCC_CCIPR1_FDCANSEL           (1 << 24)
#  define RCC_CCIPR1_FDCANSEL_SYSCLK  (0)
#  define RCC_CCIPR1_FDCANSEL_MSIK    RCC_CCIPR1_FDCANSEL
#define RCC_CCIPR1_ICLKSEL_SHIFT      (26)
#define RCC_CCIPR1_ICLKSEL_MASK       (0x3 << RCC_CCIPR1_ICLKSEL_SHIFT)
#define RCC_CCIPR1_ICLKSEL(n)         ((n) << RCC_CCIPR1_ICLKSEL_SHIFT)
#  define RCC_CCIPR1_ICLKSEL_HSI48    RCC_CCIPR1_ICLKSEL(0)
#  define RCC_CCIPR1_ICLKSEL_MSIK     RCC_CCIPR1_ICLKSEL(1)
#  define RCC_CCIPR1_ICLKSEL_HSE      RCC_CCIPR1_ICLKSEL(2)
#  define RCC_CCIPR1_ICLKSEL_SYSCLK   RCC_CCIPR1_ICLKSEL(3)
#define RCC_CCIPR1_USB1SEL            (1 << 28)
#  define RCC_CCIPR1_USB1SEL_ICLK     (0)
#  define RCC_CCIPR1_USB1SEL_ICLK_DIV2 RCC_CCIPR1_USB1SEL
#define RCC_CCIPR1_TIMICSEL_SHIFT     (29)
#define RCC_CCIPR1_TIMICSEL_MASK      (0x7 << RCC_CCIPR1_TIMICSEL_SHIFT)
#define RCC_CCIPR1_TIMICSEL(n)        ((n) << RCC_CCIPR1_TIMICSEL_SHIFT)
#  define RCC_CCIPR1_TIMICSEL_DISABLE RCC_CCIPR1_TIMICSEL(0)
#  define RCC_CCIPR1_TIMICSEL_HSI256_S1024_S4 \
    RCC_CCIPR1_TIMICSEL(4)
#  define RCC_CCIPR1_TIMICSEL_HSI256_S1024_K4 \
    RCC_CCIPR1_TIMICSEL(5)
#  define RCC_CCIPR1_TIMICSEL_HSI256_K1024_S4 \
    RCC_CCIPR1_TIMICSEL(6)
#  define RCC_CCIPR1_TIMICSEL_HSI256_K1024_K4 \
    RCC_CCIPR1_TIMICSEL(7)

