apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_rcc.h
/* RCC peripheral independent clock configuration register 2 */

#define RCC_CCIPR2_RESET              0x00000000
#define RCC_CCIPR2_ADF1SEL_SHIFT      (0)
#define RCC_CCIPR2_ADF1SEL_MASK       (0x3 << RCC_CCIPR2_ADF1SEL_SHIFT)
#define RCC_CCIPR2_ADF1SEL(n)         ((n) << RCC_CCIPR2_ADF1SEL_SHIFT)
#  define RCC_CCIPR2_ADF1SEL_HCLK     RCC_CCIPR2_ADF1SEL(0)
#  define RCC_CCIPR2_ADF1SEL_AUDIOCLK RCC_CCIPR2_ADF1SEL(1)
#  define RCC_CCIPR2_ADF1SEL_MSIK     RCC_CCIPR2_ADF1SEL(2)
#  define RCC_CCIPR2_ADF1SEL_SAI1     RCC_CCIPR2_ADF1SEL(3)
#define RCC_CCIPR2_SPI3SEL            (1 << 3)
#  define RCC_CCIPR2_SPI3SEL_PCLK1    (0)
#  define RCC_CCIPR2_SPI3SEL_MSIK     RCC_CCIPR2_SPI3SEL
#define RCC_CCIPR2_SAI1SEL_SHIFT      (5)
#define RCC_CCIPR2_SAI1SEL_MASK       (0x3 << RCC_CCIPR2_SAI1SEL_SHIFT)
#define RCC_CCIPR2_SAI1SEL(n)         ((n) << RCC_CCIPR2_SAI1SEL_SHIFT)
#  define RCC_CCIPR2_SAI1SEL_MSIK     RCC_CCIPR2_SAI1SEL(0)
#  define RCC_CCIPR2_SAI1SEL_AUDIOCLK RCC_CCIPR2_SAI1SEL(1)
#  define RCC_CCIPR2_SAI1SEL_HSE      RCC_CCIPR2_SAI1SEL(2)
#define RCC_CCIPR2_SPI4SEL            (1 << 7)
#  define RCC_CCIPR2_SPI4SEL_PCLK1    (0)
#  define RCC_CCIPR2_SPI4SEL_MSIK     RCC_CCIPR2_SPI4SEL
#define RCC_CCIPR2_I2C4SEL            (1 << 9)
#  define RCC_CCIPR2_I2C4SEL_PCLK1    (0)
#  define RCC_CCIPR2_I2C4SEL_MSIK     RCC_CCIPR2_I2C4SEL
#define RCC_CCIPR2_RNGSEL             (1 << 11)
#  define RCC_CCIPR2_RNGSEL_HSI48     (0)
#  define RCC_CCIPR2_RNGSEL_MSIK      RCC_CCIPR2_RNGSEL
#define RCC_CCIPR2_ADCDACPRE_SHIFT    (12)
#define RCC_CCIPR2_ADCDACPRE_MASK     (0xf << RCC_CCIPR2_ADCDACPRE_SHIFT)
#define RCC_CCIPR2_ADCDACPRE(n)       ((n) << RCC_CCIPR2_ADCDACPRE_SHIFT)
#  define RCC_CCIPR2_ADCDACPRE_DIV1   RCC_CCIPR2_ADCDACPRE(0)
#  define RCC_CCIPR2_ADCDACPRE_DIV2   RCC_CCIPR2_ADCDACPRE(1)
#  define RCC_CCIPR2_ADCDACPRE_DIV4   RCC_CCIPR2_ADCDACPRE(8)
#  define RCC_CCIPR2_ADCDACPRE_DIV8   RCC_CCIPR2_ADCDACPRE(9)
#  define RCC_CCIPR2_ADCDACPRE_DIV16  RCC_CCIPR2_ADCDACPRE(10)
#  define RCC_CCIPR2_ADCDACPRE_DIV32  RCC_CCIPR2_ADCDACPRE(11)
#  define RCC_CCIPR2_ADCDACPRE_DIV64  RCC_CCIPR2_ADCDACPRE(12)
#  define RCC_CCIPR2_ADCDACPRE_DIV128 RCC_CCIPR2_ADCDACPRE(13)
#  define RCC_CCIPR2_ADCDACPRE_DIV256 RCC_CCIPR2_ADCDACPRE(14)
#  define RCC_CCIPR2_ADCDACPRE_DIV512 RCC_CCIPR2_ADCDACPRE(15)
#define RCC_CCIPR2_ADCDACSEL_SHIFT    (16)
#define RCC_CCIPR2_ADCDACSEL_MASK     (0x3 << RCC_CCIPR2_ADCDACSEL_SHIFT)
#define RCC_CCIPR2_ADCDACSEL(n)       ((n) << RCC_CCIPR2_ADCDACSEL_SHIFT)
#  define RCC_CCIPR2_ADCDACSEL_HCLK   RCC_CCIPR2_ADCDACSEL(0)
#  define RCC_CCIPR2_ADCDACSEL_HSE    RCC_CCIPR2_ADCDACSEL(1)
#  define RCC_CCIPR2_ADCDACSEL_MSIK   RCC_CCIPR2_ADCDACSEL(2)
#define RCC_CCIPR2_DAC1SHSEL          (1 << 19)
#  define RCC_CCIPR2_DAC1SHSEL_LSE    (0)
#  define RCC_CCIPR2_DAC1SHSEL_LSI    RCC_CCIPR2_DAC1SHSEL
#define RCC_CCIPR2_OCTOSPISEL         (1 << 20)
#  define RCC_CCIPR2_OCTOSPISEL_SYSCLK (0)
#  define RCC_CCIPR2_OCTOSPISEL_MSIK  RCC_CCIPR2_OCTOSPISEL
#define RCC_CCIPR2_USART2SEL          (1 << 22)
#  define RCC_CCIPR2_USART2SEL_PCLK1  (0)
#  define RCC_CCIPR2_USART2SEL_HSI    RCC_CCIPR2_USART2SEL

/* RCC peripheral independent clock configuration register 3 */

#define RCC_CCIPR3_RESET              0x00000000
#define RCC_CCIPR3_LPUART1SEL_SHIFT   (0)
#define RCC_CCIPR3_LPUART1SEL_MASK    (0x3 << RCC_CCIPR3_LPUART1SEL_SHIFT)
#define RCC_CCIPR3_LPUART1SEL(n)      ((n) << RCC_CCIPR3_LPUART1SEL_SHIFT)
#  define RCC_CCIPR3_LPUART1SEL_PCLK3 RCC_CCIPR3_LPUART1SEL(0)
#  define RCC_CCIPR3_LPUART1SEL_HSI   RCC_CCIPR3_LPUART1SEL(1)
#  define RCC_CCIPR3_LPUART1SEL_LSE   RCC_CCIPR3_LPUART1SEL(2)
#  define RCC_CCIPR3_LPUART1SEL_MSIK  RCC_CCIPR3_LPUART1SEL(3)
#define RCC_CCIPR3_I2C3SEL            (1 << 6)
#  define RCC_CCIPR3_I2C3SEL_PCLK3    (0)
#  define RCC_CCIPR3_I2C3SEL_MSIK     RCC_CCIPR3_I2C3SEL
#define RCC_CCIPR3_LPTIM34SEL_SHIFT   (8)
#define RCC_CCIPR3_LPTIM34SEL_MASK    (0x3 << RCC_CCIPR3_LPTIM34SEL_SHIFT)
#define RCC_CCIPR3_LPTIM34SEL(n)      ((n) << RCC_CCIPR3_LPTIM34SEL_SHIFT)
#  define RCC_CCIPR3_LPTIM34SEL_MSIK  RCC_CCIPR3_LPTIM34SEL(0)
#  define RCC_CCIPR3_LPTIM34SEL_LSI   RCC_CCIPR3_LPTIM34SEL(1)
#  define RCC_CCIPR3_LPTIM34SEL_HSI   RCC_CCIPR3_LPTIM34SEL(2)
#  define RCC_CCIPR3_LPTIM34SEL_LSE   RCC_CCIPR3_LPTIM34SEL(3)
#define RCC_CCIPR3_LPTIM1SEL_SHIFT    (10)
#define RCC_CCIPR3_LPTIM1SEL_MASK     (0x3 << RCC_CCIPR3_LPTIM1SEL_SHIFT)
#define RCC_CCIPR3_LPTIM1SEL(n)       ((n) << RCC_CCIPR3_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR3_LPTIM1SEL_MSIK   RCC_CCIPR3_LPTIM1SEL(0)
#  define RCC_CCIPR3_LPTIM1SEL_LSI    RCC_CCIPR3_LPTIM1SEL(1)
#  define RCC_CCIPR3_LPTIM1SEL_HSI    RCC_CCIPR3_LPTIM1SEL(2)
#  define RCC_CCIPR3_LPTIM1SEL_LSE    RCC_CCIPR3_LPTIM1SEL(3)

/* RCC backup domain control register */

#define RCC_BDCR_RESET                0x00000000
#define RCC_BDCR_LSEON                (1 << 0)
#define RCC_BDCR_LSERDY               (1 << 1)
#define RCC_BDCR_LSEBYP               (1 << 2)
#define RCC_BDCR_LSEDRV_SHIFT         (3)
#define RCC_BDCR_LSEDRV_MASK          (0x3 << RCC_BDCR_LSEDRV_SHIFT)
#define RCC_BDCR_LSEDRV(n)            ((n) << RCC_BDCR_LSEDRV_SHIFT)
#  define RCC_BDCR_LSEDRV_LOW         RCC_BDCR_LSEDRV(0)
#  define RCC_BDCR_LSEDRV_MEDLOW      RCC_BDCR_LSEDRV(1)
#  define RCC_BDCR_LSEDRV_MEDHIGH     RCC_BDCR_LSEDRV(2)
#  define RCC_BDCR_LSEDRV_HIGH        RCC_BDCR_LSEDRV(3)
#define RCC_BDCR_LSECSSON             (1 << 5)
#define RCC_BDCR_LSECSSD              (1 << 6)
#define RCC_BDCR_LSESYSEN             (1 << 7)
#define RCC_BDCR_RTCSEL_SHIFT         (8)
#define RCC_BDCR_RTCSEL_MASK          (0x3 << RCC_BDCR_RTCSEL_SHIFT)
#define RCC_BDCR_RTCSEL(n)            ((n) << RCC_BDCR_RTCSEL_SHIFT)
#  define RCC_BDCR_RTCSEL_NONE        RCC_BDCR_RTCSEL(0)
#  define RCC_BDCR_RTCSEL_LSE         RCC_BDCR_RTCSEL(1)
#  define RCC_BDCR_RTCSEL_LSI         RCC_BDCR_RTCSEL(2)
#  define RCC_BDCR_RTCSEL_HSE_DIV32   RCC_BDCR_RTCSEL(3)
#define RCC_BDCR_LSESYSRDY            (1 << 11)
#define RCC_BDCR_LSEGFON              (1 << 12)
#define RCC_BDCR_RTCEN                (1 << 15)
#define RCC_BDCR_BDRST                (1 << 16)
#define RCC_BDCR_LSCOEN               (1 << 24)
#define RCC_BDCR_LSCOSEL              (1 << 25)
#  define RCC_BDCR_LSCOSEL_LSI        (0)
#  define RCC_BDCR_LSCOSEL_LSE        RCC_BDCR_LSCOSEL

/* RCC control/status register */

