apache/nuttx/arch/arm/src/stm32u3/hardware/stm32u3xx_rcc.h
#define RCC_CSR_RESET                 0x0c005500
#define RCC_CSR_LSION                 (1 << 0)
#define RCC_CSR_LSIRDY                (1 << 1)
#define RCC_CSR_LSIPREDIV             (1 << 2)
#define RCC_CSR_MSIKDIVS_SHIFT        (8)
#define RCC_CSR_MSIKDIVS_MASK         (0x3 << RCC_CSR_MSIKDIVS_SHIFT)
#define RCC_CSR_MSIKDIVS(n)           ((n) << RCC_CSR_MSIKDIVS_SHIFT)
#  define RCC_CSR_MSIKDIVS_12MHZ      RCC_CSR_MSIKDIVS(1)
#  define RCC_CSR_MSIKDIVS_6MHZ       RCC_CSR_MSIKDIVS(2)
#  define RCC_CSR_MSIKDIVS_3MHZ       RCC_CSR_MSIKDIVS(3)
#define RCC_CSR_MSISDIVS_SHIFT        (12)
#define RCC_CSR_MSISDIVS_MASK         (0x3 << RCC_CSR_MSISDIVS_SHIFT)
#define RCC_CSR_MSISDIVS(n)           ((n) << RCC_CSR_MSISDIVS_SHIFT)
#  define RCC_CSR_MSISDIVS_12MHZ      RCC_CSR_MSISDIVS(1)
#  define RCC_CSR_MSISDIVS_6MHZ       RCC_CSR_MSISDIVS(2)
#  define RCC_CSR_MSISDIVS_3MHZ       RCC_CSR_MSISDIVS(3)
#define RCC_CSR_RMVF                  (1 << 23)
#define RCC_CSR_OBLRSTF               (1 << 25)
#define RCC_CSR_PINRSTF               (1 << 26)
#define RCC_CSR_BORRSTF               (1 << 27)
#define RCC_CSR_SFTRSTF               (1 << 28)
#define RCC_CSR_IWDGRSTF              (1 << 29)
#define RCC_CSR_WWDGRSTF              (1 << 30)
#define RCC_CSR_LPWRRSTF              (1 << 31)

/* RCC secure configuration register */

#define RCC_SECCFGR_RESET             0x00000000
#define RCC_SECCFGR_HSISEC            (1 << 0)
#define RCC_SECCFGR_HSESEC            (1 << 1)
#define RCC_SECCFGR_MSISEC            (1 << 2)
#define RCC_SECCFGR_LSISEC            (1 << 3)
#define RCC_SECCFGR_LSESEC            (1 << 4)
#define RCC_SECCFGR_SYSCLKSEC         (1 << 5)
#define RCC_SECCFGR_PRESCSEC          (1 << 6)
#define RCC_SECCFGR_BOOSTSEC          (1 << 7)
#define RCC_SECCFGR_ICLKSEC           (1 << 10)
#define RCC_SECCFGR_HSI48SEC          (1 << 11)
#define RCC_SECCFGR_RMVFSEC           (1 << 12)

/* RCC privilege configuration register */

#define RCC_PRIVCFGR_RESET            0x00000000
#define RCC_PRIVCFGR_SPRIV            (1 << 0)
#define RCC_PRIVCFGR_NSPRIV           (1 << 1)

#endif /* __ARCH_ARM_SRC_STM32U3_HARDWARE_STM32U3XX_RCC_H */
